/*1--------------------------------------------------------*/
struct
{
    int a;
    char b;
    float c;
} x; //x为一个结构体变量,他包含三个成员
/*2---------------------------------------------------------------*/
struct
{
    int a;
    char b;
    float c;
} y[20], *z; //z指向这个类型的结构,y含有20个这样的结构
/*上面两个结构体不相同,即使拥有相同的变量*/
/*3-----------------------------------------------------------------*/
//可以通过在struct后面添加标签来定义特定类型的结构,如:

struct simple
{
    int a;
    char b;
    float c;
};                       //但是并未创建变量
struct simple y[20], *z; //正式创建了变量
/*4---------------------------------------------------------------*/
//更精巧的方式:
typedef struct
{
    int a;
    char b;
    float c;
} simple; //simple为该新定义的结构体的类型名

simple t[20]; //相比上面的少写了struct
/*5---------------------------------------------------------*/
struct simple
{
    int a;
    char b;
    int c[20];
} name;
//上面这个结构体叫simple,而name是一个结构体变量,一个叫simple结构体的变量
//相当于simple是超市的货架名,name是货架商品(感觉和类差不对)
//<<C和指针>>P128的图很好
